# строка - "string" - "___"
----------------------------------
# :002 > "string".object_id
#=> 18646700
# :003 > "string".object_id
#=> 19900540
# :004 > "string".object_id == "string".object_id
#=> false
# :005 > "string" == "string"
#=> true
-----------------------------
# символ -  :symbol1 - :___
-----------------------------
# :006 > :symbol1
#=> :symbol1
# :007 > :symbol1.object_id
#=> 1198748
# :008 > :symbol1.object_id
#=> 1198748
# :009 > :symbol1.object_id == :symbol1.object_id
#=> true
----------------------
# массив - Array - __ = []
--------------------------
# :010 > arr = [1, 2, 3, 4, 5]
#=> [1, 2, 3, 4, 5]
# :011 > arr2 = [0, 6, 3, "str"]
#=> [0, 6, 3, "str"]
# :012 > arr.class
#=> Array
# :013 > arr[0]
#=> 1
# :014 > arr[2]
#=> 3
# :015 > arr[5]
#=> nil
# :016 > arr[2] = 40
#=> 40
# :017 > arr
#=> [1, 2, 40, 4, 5]
# :018 > arr.size
#=> 5
# :019 > arr.any?
#=> true
# :020 > arr.empty?
#=> false
# :021 > arr3 = []
#=> []
# :022 > arr3.class
#=> Array
# :023 > arr3.empty?
#=> true
# :024 > arr.push(87)
#=> [1, 2, 40, 4, 5, 87]
# :026 > arr.length
 #=> 6
# :027 > arr << 99
 #=> [1, 2, 40, 4, 5, 87, 99]
# :028 > arr.size
 #=> 7
# :029 > arr << "hey"
 #=> [1, 2, 40, 4, 5, 87, 99, "hey"]
# :031 > arr << "hey"
 #=> [1, 2, 40, 4, 5, 87, 99, "hey", "hey", "hey"]
# :032 > arr << nil
 #=> [1, 2, 40, 4, 5, 87, 99, "hey", "hey", "hey", nil]
# :033 > arr << [3, 4, 5]
 #=> [1, 2, 40, 4, 5, 87, 99, "hey", "hey", "hey", nil, [3, 4, 5]]
# :034 > arr.first
 #=> 1
# :035 > arr.last
 #=> [3, 4, 5]
# :036 > arr.delete("hey")
 #=> "hey"
# :037 > arr.delete("hey")
 #=> nil
# :038 > arr
 #=> [1, 2, 40, 4, 5, 87, 99, nil, [3, 4, 5]]
# :039 > arr.delete_at(1)
 #=> 2
# :040 > arr
 #=> [1, 40, 4, 5, 87, 99, nil, [3, 4, 5]]
# :041 > arr.compact
 #=> [1, 40, 4, 5, 87, 99, [3, 4, 5]]
# :042 > arr
 #=> [1, 40, 4, 5, 87, 99, nil, [3, 4, 5]]
# :043 > arr.compact!
 #=> [1, 40, 4, 5, 87, 99, [3, 4, 5]]
# :044 > arr
 #=> [1, 40, 4, 5, 87, 99, [3, 4, 5]]
# :045 > arr[-1]
 #=> [3, 4, 5]
# :046 > arr.delete_at(-1)
 #=> [3, 4, 5]
# :047 > arr
 #=> [1, 40, 4, 5, 87, 99]
# :048 > arr.max
 #=> 99
# :049 > arr2 = [6, 234, 1, 97, 0, 2, 4, 5, 4, 4]
 #=> [6, 234, 1, 97, 0, 2, 4, 5, 4, 4]
# :050 > arr2.sort
 #=> [0, 1, 2, 4, 4, 4, 5, 6, 97, 234]
# :052 > puts arr2
#6
#234
#1
#97
#0
#2
#4
#5
#4
#4
#=> nil
#теперь заново хэши набирать)
#ну делай дальше
#ок)
# :001 > arr = [4, 5, 7,2,]
 #=> [4, 5, 7, 2]
# :002 > arr.include?(7)
 #=> true
# :003 > arr.include?(9)
 #=> false

----------------------------------
# интервалы - Range - (___..___)
 -----------------------------
# :004 > (1..5)
 #=> 1..5
# :005 > (1..5).class
 #=> Range
# :006 > ('a'..'d')
 #=> "a".."d"
# :007 > ('a'..'d').to_a
 #=> ["a", "b", "c", "d"]
# :008 > (10..76).to_a
 #=> [10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76]
# :009 > ('a'..'f').include?('c')
 #=> true
--------------------
# hash = { a: 1, b: 2}
--------------
# :010 > hash = { a: 1, b: 2}
 #=> {:a=>1, :b=>2}
# :011 > :a.class
 #=> Symbol
# :012 > hash[:a]
 #=> 1
# :013 > hash[:b]
 #=> 2
# :014 > month = {'january' => 31, 'february' => 28, 'march' => 31}
 #=> {"january"=>31, "february"=>28, "march"=>31}
# :015 > month['march']
 #=> 31
# :016 > hash[:a] = 'str'
 #=> "str"
# :018 > hash
 #=> {:a=>"str", :b=>2}
# :001 > month = {'january' => 31, 'february' => 28, 'march' => 31}
 #=> {"january"=>31, "february"=>28, "march"=>31}
# :002 > month
 #=> {"january"=>31, "february"=>28, "march"=>31}
# :003 > hash = {a: "str", b: 2}
 #=> {:a=>"str", :b=>2}
# :004 > hash[:a]
 #=> "str"
# :005 > hash['a']
 #=> nil
# :006 > hash[:c]
 #=> nil
# :007 > hash.keys
 #=> [:a, :b]
# :008 > hash.values
 #=> ["str", 2]
# :009 > hash[:c] = 45
 #=> 45
# :010 > hash
 #=> {:a=>"str", :b=>2, :c=>45}
# :012 > ;hash.include? :c
#=> true
# :013 > cities = { moscow: ['ЦАО', "СЗАО"], spb: ["Купчино", "В.Остров"]}
#=> {:moscow=>["ЦАО", "СЗАО"], :spb=>["Купчино", "В.Остров"]}
# :014 > cities[:spb]
#=> ["Купчино", "В.Остров"]
# :001 > regions = { 77 => {title: 'Москва', code: 495, time_zone: 0 }, 78 #=> {title: "С.-Петербург", code: 812, time_zone: 0 } }
 #=> {77=>{:title=>"Москва", :code=>495, :time_zone=>0}, 78=>{:title=>"С.-Петербург", :code=>812, :time_zone#=>0}}
# :002 > regions[77]
 #=> {:title=>"Москва", :code=>495, :time_zone=>0}
# :004 > regions[77][:title]
 #=> "Москва"
# :005 > regions[77][:code]
 #=> 495
-----------------------------------------------
# интервалы и хэши в массивы .to_a
-----------------------------------------------
# :001 > hash = {a: 1, b: 2, c: 3 }
 #=> {:a=>1, :b=>2, :c=>3}
# :003 > hash.to_a
 #=> [[:a, 1], [:b, 2], [:c, 3]]

#
# # :007 > ('a'..'d').to_a
#=> ["a", "b", "c", "d"]
------------------------------------------
# интервалы
--------------------------------
# :004 > range = (1..5)
 #=> 1..5
# :005 > for index in range
# :006?>   puts index
# :007?>   end
#1
#2
#3
#4
#5
 #=> 1..5
# :008 > index = 0
 #=> 0
# :009 > while index < 5 do
# :010 >     puts index
# :011?>   index +=2
# :012?>   end
#0
#2
#4
 #=> nil
# :013 > until index > 5 do
# :014 >     puts index
# :015?>   index += 2
# :016?>   end
 #=> nil
# :017 > index = 0
 #=> 0
# :018 > until index > 5 do
# :019 >     puts index
# :020?>   index += 2
# :021?>   end
#0
#2
#4
 #=> nil
# :022 > a = [1,2,3,4,5,6]
 #=> [1, 2, 3, 4, 5, 6]
# :023 > a.each do |index|
# :024 >     puts index
# :025?>   end
#1
#2
#3
#4
#5
#6
 #=> [1, 2, 3, 4, 5, 6]
# :026 > ('A'..'Z').each do |letter|
# :027 >     puts letter
# :028?>   end
#A
#B
#C
#D
#E
#F
#G
#H
#I
#J
#K
#L
#M
#N
#O
#P
#Q
#R
#S
#T
#U
#V
#W
#X
#Y
#Z
 #=> "A".."Z"
# :029 > ('A'..'Z').each { |l| puts l }
#A..
#Z
 #=> "A".."Z"
# :030 > l = 'local var'
 #=> "local var"
# :031 > puts l
#local var
 #=> nil
# :032 > ('A'..'D').each { |l| puts l }
 #A
 #B
 #C
 #D
 #=> "A".."D"
# :033 > puts l
#local var
 #=> nil
--------------------------
#  hash
------------------------------
# :035 > hash
#=> {:a#=>1, :b#=>2, :c#=>3}
# :036 > hash.each do |i|
      # :037 >     puts i.inspect
      # :038?>   end
#[:a, 1]
#[:b, 2]
#[:c, 3]
#=> {:a#=>1, :b#=>2, :c#=>3}
# :055 > hash.each do |key, value|
# :056 >     puts "#{key} = #{value}"
# :057?>   end
#a = 1
#b = 2
#c = 3
#=> {:a#=>1, :b#=>2, :c#=>3}
------------------
# массив - Array - __ = []
----------------------------------
# :058 > new_array = [1, 2, 3, 4, 5].map { |i| i+2 }
#=> [3, 4, 5, 6, 7]
# :059 > new_array
#=> [3, 4, 5, 6, 7]
# :060 > new_array = a.map { |i| i+2 }
#=> [3, 4, 5, 6, 7, 8]
# :061 > a
#=> [1, 2, 3, 4, 5, 6]
# :062 > new_array = []
#=> []
# :066 > a.each do |i|
# :067 >     new_array << i+2
# :068?>   end
 #=> [1, 2, 3, 4, 5, 6]
# :070 > new_array
#=> [3, 4, 5, 6, 7, 8]


