!!!!!!!!!!!!!!!терминал
narielkatarios@NarielKatarios-Lenovo-V110-15ISK:~$
ls - показывает все папки
mkdir ruby - возвращает выше в папку?
fish - программа для помощи
./RubyMine/bin/rubymine.sh  - запуск рубимайн из терминала
sudo apt-get update - после установки линукса - обновление
sudo apt get mc - слетела руби, не работает ирб
️~ - тильда означает дрмашнюю папку
cd = change directory - войти в папку из домашней папки
-----------------------------------------------
установи bundler mc fish
sudo apt-get install bundler mc fish
 ---------------------------------------------
 github.com

ЧТОБЫ ЗАПУШИТЬ ЗАДАНИЯ В ГИТХАБ!
выполни в терминале в своей папке
cd ruby
git add .
    git commit -m 'задание 6'
git push
(или git push origin master если не получится)
ПЕРВОЕ ПОЛУЧИЛОСЬ
-------------------------------------------------
как файл в терминале открыть
прям из корневой папки
ruby ruby/04/main.rb
или
cd ruby
ruby 04/main.rb
командная строка предназначена для работы с файлами
а интерпретатор руби - только с командами и аргументами
тоесть
load - это команда
а имя файла в кавычках - это аргумент строка
если написать без кавычек - то интерпретатор подумает что это команда или переменнная
---------------------------------------------------------------
!!!!!!!!!!!!!!!!БРАУЗЕР!
http://rextester.com/l/ruby - руби в онлайне
rubular.com - справочник шаблонов- регулярных выражений

--------------------------------------------------------






!!!!!!!!!!!!!!!Рубимайн
shift+f6+fn- переименовать файл
edit undo - отмена последнего действия
control+r- замена текста
------------------------------------------------
МЕТОД PUTS - вывести на экран строку
puts - просто выводит на экран всё, что следует за ним
puts     5 * (12-8) + -15
возврат -29802
puts 'Привет, мир!'
возврат Привет, мир!
puts 'Я люблю ' + 'яблочный пирог.'
возврат Я люблю яблочный пирог.
puts 'миг ' * 4
возврат миг миг миг миг
----------------------------------------------
МЕТОД GETS - получить строку
МЕТОД CHOMP - убирает все энтеры в конце строки
name = gets.chomp
------------------------------------------
МЕТОД REVERSE - выдаёт значение строки, перевёрнутое задом наперёд:
var1 = 'барк'
puts var1.reverse
краб
-----------------------------
МЕТОД LENGTH
name.length.to_s - '22'
-------------------------------------
МЕТОД UPCASE изменяет каждую строчную букву на заглавную
метод DOWNCASE изменяет каждую заглавную букву на строчную.
МЕТОД SWAPCASE переключает регистр каждой буквы в строке
МЕТОД CAPITALIZE как downcase, только он переводит первую букву в заглавную (если
это буква).
letters = 'aAbBcCdDeE'
puts letters.capitalize
Aabbccddee
-------------------------------
  2.to_s возвращает строковую версию объекта '2'
'2'.to_i возвращает целочисленную версию значения объекта 2
  2.to_f возвращает плавающую версию 2.0
----------------------------











------------------------------------------------------------




















-------------------------------------------------------------
ВОПРОСЫ!!!!!!!!!!!!!
как 4 окна в линуксе сделать?????????????
про неработающий мик: надо гуглить именно эту модель ноутбука


